Revit 2026 API

# ScheduleFieldSetCombinedParameters Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
```
```vb
Public Sub SetCombinedParameters (
	data As IList(Of TableCellCombinedParameterData)
)
```
```cpp
public:
void SetCombinedParameters(
	IList<TableCellCombinedParameterData^>^ data
)
```
```fsharp
member SetCombinedParameters :
        data : IList<TableCellCombinedParameterData> -> unit
```

#### Parameters

data IListTableCellCombinedParameterData

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace